## importing libraries:-

In [1]:
import numpy as np
import pandas as pd

## the normal equation:-

In [19]:
def Normal_Eqt(X,y):
    theta_best=np.linalg.inv(X.T.dot(X)).dot(X.T).dot(y)
    return theta_best

## applying the "normal equation" to a data set ( adding bias x_0 as 1 myself )

In [4]:
data = pd.read_csv("real_estate_price_size_year_view.csv")
data.head()

        price     size  year         view
0  234314.144   643.09  2015  No sea view
1  228581.528   656.22  2009  No sea view
2  281626.336   487.29  2018     Sea view
3  401255.608  1504.75  2015  No sea view
4  458674.256  1275.46  2009     Sea view

In [5]:
data["view"]=data["view"].map({"No sea view":0,"Sea view":1})

In [6]:
data.head()

        price     size  year  view
0  234314.144   643.09  2015     0
1  228581.528   656.22  2009     0
2  281626.336   487.29  2018     1
3  401255.608  1504.75  2015     0
4  458674.256  1275.46  2009     1

In [16]:
y=np.array(data["price"])
x_bias=np.ones((data.shape[0],1))
x=data[["size","year","view"]]
x["ones"]=x_bias
x=np.array(x)

In [20]:
paramter_list=Normal_Eqt(x,y)

In [23]:
predicted_values=paramter_list.T.dot(x.T)

In [30]:
results=pd.DataFrame()
results["predicted_values"]=predicted_values
results["actual_values"]=y
print(pd.DataFrame(paramter_list))

              0
0  2.230316e+02
1  2.718949e+03
2  5.672602e+04
3 -5.397914e+06

In [29]:
results

    predicted_values  actual_values
0      224197.233180     234314.144
1      210811.945012     228581.528
2      254331.773334     281626.336
3      416374.658397     401255.608
4      405648.064839     458674.256
..               ...            ...
95     243802.939868     252460.400
96     295836.058979     310522.592
97     391904.118399     383635.568
98     225356.997601     225145.248
99     270325.279711     274922.856

[100 rows x 2 columns]